app/views/comments/_comment.html.erb


    <%= @comment.likes.count%> like
    <% if comment.likes.exists?(user_id: current_user.id) %>
      <%= button_to 'Unlike', bblog_post_comment_like_path(@bblog, @post, comment, comment.likes.first), method: :delete %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."comment_id" = ? ORDER BY "likes"."id" ASC LIMIT ?  [["comment_id", 4], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."comment_id" IS NULL LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT 1 AS one FROM "likes" WHERE "likes"."comment_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["comment_id", 4], ["user_id", 3], ["LIMIT", 1]]