app/controllers/bblogs_controller.rb

    def index
        @bblogs = Bblog.all
---
SELECT "bblogs".* FROM "bblogs"

    def create
        @bblog = Bblog.new(bblog_params)
        authorize @bblog
        if @bblog.save
---
INSERT INTO "bblogs" ("custom_domain", "title", "theme", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["custom_domain", nil], ["title", "lincoln "], ["theme", nil], ["created_at", "2024-03-20 11:42:28.818975"], ["updated_at", "2024-03-20 11:42:28.818975"]]

    def set_bblog
        @bblog = Bblog.find(params[:id])
---
SELECT "bblogs".* FROM "bblogs" WHERE "bblogs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]