app/controllers/comments_controller.rb

    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(comment_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "date", "created_at", "updated_at", "post_id") VALUES (?, ?, ?, ?, ?)  [["content", nil], ["date", nil], ["created_at", "2024-01-30 14:35:11.663090"], ["updated_at", "2024-01-30 14:35:11.663090"], ["post_id", 1]]