app/controllers/likes_controller.rb

SELECT "bblogs".* FROM "bblogs" WHERE "bblogs"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "likes" ("comment_id", "user_id", "post_id", "bblog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment_id", 4], ["user_id", 3], ["post_id", 16], ["bblog_id", 12], ["created_at", "2024-04-05 14:55:57.452000"], ["updated_at", "2024-04-05 14:55:57.452000"]]
---
    def create
        @bblog = Bblog.find(params[:bblog_id])
        @post= Post.find(params[:id])
        @comment = Comment.find(params[:comment_id])


        @like = @comment.likes.new(user_id: current_user.id)
        @like.save!

SELECT "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 16]]
---
    def destroy
        @like = Like.find(params[:id])
        comment = @like.comment
        @like.destroy

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
        def find_comment
            @comment = Comment.find(params[:comment_id])