app/controllers/posts_controller.rb

  def index
    puts params
    @bblog = Bblog.find(params[:bblog_id])
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

    def set_post
      @post = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]