app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "bblogs".* FROM "bblogs" WHERE "bblogs"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  def show
    @post= Post.find(params[:id])
    @comment = @post.comments.build

      @bblog = Bblog.find(params[:bblog_id])

INSERT INTO "posts" ("title", "content", "author_name", "published_at", "created_at", "updated_at", "bblog_id", "category_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "categories" ("category_name", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category_name", "Musique"], ["post_id", nil], ["created_at", "2024-04-25 12:37:57.599839"], ["updated_at", "2024-04-25 12:37:57.599839"]]
SELECT "categories".* FROM "categories" WHERE "categories"."category_name" = ? LIMIT ?  [["category_name", "Musique"], ["LIMIT", 1]]
---
  def create
    @post = @bblog.posts.build(post_params)


    authorize @post
    respond_to do |format|
      if @post.save
        @category = Category.find_or_create_by(category_name: params[:post][:category_name])

UPDATE "posts" SET "published_at" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["published_at", "2024-02-02 08:47:00"], ["updated_at", "2024-02-02 07:47:36.616040"], ["id", 27]]
---
  def update

    authorize @post
    respond_to do |format|
      if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 7]]
---
  def destroy
    blog_id = @post.bblog_id
    authorize @post
    @post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_post
      @post = Post.find_by(id: params[:id])

SELECT "bblogs".* FROM "bblogs" WHERE "bblogs"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
    def set_bblog
      @bblog = Bblog.find(params[:bblog_id])